//================================================================================
//  FileName: EnumLogsType.cs
//  Desc:日志类型枚举。
//
//  Called by
//
//  Auth:杨勇（jeason1914@gmail.com）
//  Date: 2009-11-16
//================================================================================
//  Change History
//================================================================================
//  Date  Author  Description
//  ----    ------  -----------------
//
//================================================================================
//  Copyright (C) 2004-2009 Jeason Young Corporation
//================================================================================
namespace iPower.Logs
{
    /// <summary>
    /// 日志类型枚举。
    /// </summary>
    public enum EnumLogsType
    {
        /// <summary>
        /// 普通日志。
        /// </summary>
        Normal,
        /// <summary>
        /// 警告日志。
        /// </summary>
        Warning,
        /// <summary>
        /// 错误日志。
        /// </summary>
        Error
    }
}
